УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/смартЗаявкаНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЗаявкаНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <basedOn>Document.смартЗаявкаНаРемонтныеРаботы</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <registerRecords>AccumulationRegister.смартОборудованиеКРазборке</registerRecords>
  <registerRecords>AccumulationRegister.смартЗаявкиНаРазборкуОборудования</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.смартЗаявкаНаРемонтныеРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереместитьСоСклада</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаРазбора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Командировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.смартСтатусыСогласованияЗаявокНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КВыполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРазборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелПереместитьНаСклад</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСнятаяЗапаснаяЧасть</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПолученныйУзел</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНаЗаменуСнятойЗапаснойЧасти</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаНеТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <comment>#1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования</comment>
    <attributes>
      <name>АртикулСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереместитьНаСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаказывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера2</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартСостоянияЗаявокНаРазборкуОборудования/смартСостоянияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСостоянияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.смартСостоянияЗаявокНаРазборкуОборудования</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/смартОборудованиеКРазборке/смартОборудованиеКРазборке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартОборудованиеКРазборке</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КРазборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщикуЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудованиеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСостоянияЗаявокНаРазборкуОборудования/смартСостоянияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>ВводНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяСборка</name>
  </enumValues>
  <enumValues>
    <name>КЗаказуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ЗаказанУПоставщика</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСтатусыСогласованияЗаявокНаРазборкуОборудования/смартСтатусыСогласованияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыСогласованияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <enumValues>
    <name>НеУстановлен</name>
  </enumValues>
  <enumValues>
    <name>КСогласованию</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		ЭтаФорма.РемонтируемоеОборудование =
			Объект.ДокументОснование.Оборудование[0].Оборудование;				
			
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
				И ТипЗнч(Объект.ДокументОснование.Предмет) = Тип("СправочникСсылка.Номенклатура") Тогда
				
		ЭтаФорма.РемонтируемоеОборудование = Объект.ДокументОснование.Предмет;
			
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УстановитьВидимость();
	СформироватьНаименованиеНовогоУзла();
	
	//++ #5104 смарт: Тимофеева 03.12.2025 / Заявка на разборку оборудования. Добавить раздел Заметки по заявке. 
	ЗаметкиПоДокументу.Параметры.УстановитьЗначениеПараметра("Предмет", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаметкиПоДокументу, "Предмет", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	//-- #5104 смарт: Тимофеева 03.12.20251

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ТребуетсяЗакрытьФорму") Тогда
		Закрыть();
	Иначе
		//++ #Б1994 смарт: Шляпников 21.02.2025 / Изменить выводимую информацию в колонки, в журнале IECHO Спецификация (смарт)
		УстановитьВидимость();
		//-- #Б1994 смарт: Шляпников 21.02.2025
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти     

#Область ВнешнииСобытия

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	//Если ИмяСобытия = "ПоискОборудованияПоСкладамВыборОборудования" Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(Объект, Параметр, "Номенклатура, Серия");
	//	
	//	Если Не Параметр.Склад = Объект.Склад Тогда
	//		Объект.ПереместитьСоСклада = Параметр.Склад;
	//	КонецЕсли;
	//	
	//	ЭтаФорма.Модифицированность = Истина;
	//	
	//КонецЕсли;
	
	Если ИмяСобытия = "ПоискКомплектующихПоСкладамВыборКомплектующих" Тогда
		
		ДобавитьОбновитьКомплектующие(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбновитьКомплектующие(Данные)

	НайденныеСтроки = Объект.Комплектующие.НайтиСтроки(Новый Структура("Номенклатура", Данные.Номенклатура));
	Если Не НайденныеСтроки.Количество() Тогда
		
		НоваяСтрока = Объект.Комплектующие.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.НеЗаказывать = Объект.СборкаНеТребуется;
		
	КонецЕсли;
	
	КомплектующиеНоменклатураПриИзмененииНаСервере();
	//++ #Б2028 смарт: Шляпников 11.02.2025 / Заявка на разборку оборудования. Формирование нового узла номенклатуры (результат разборки).
	СформироватьНаименованиеНовогоУзла();
	//-- #Б2028 смарт: Шляпников 11.02.2025
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискОборудованияПоСкладам(Команда)
	
	ОткрытьФорму("Документ.смартЗаявкаНаРазборкуОборудования.Форма.ФормаПодбораОборудования",
					Новый Структура("Оборудование,Организация", Объект.Номенклатура, Объект.Организация),
					ЭтаФорма,,,,
					Новый ОписаниеОповещения("ПоискОборудованияПоСкладамЗавершение", ЭтаФорма),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуСПодтверждением(Команда) 
	
	ИмяКоманды = Команда.Имя;
	
	ДополнительныеПараметрыОповещения = Новый Структура("ИмяКоманды", ИмяКоманды);
	МодульХраненияМетодаОповещения = ЭтотОбъект;
	
	МетодОповещения = "ОбработатьРезультатОтветаНаВопрос";

	ЗаголовокВопроса = "Согласование заявки";
	
	Если ИмяКоманды = "КСогласованию"
			Или ИмяКоманды = "Согласована"
			Или ИмяКоманды = "НеСогласована" Тогда
	
		Если ИмяКоманды = "КСогласованию" Тогда
			
			ТекстВопроса = 
				"Заявка будет передана на согласование.
				|Продолжить?";
		
		ИначеЕсли ИмяКоманды = "Согласована" Тогда
			
			ТекстВопроса = 
				"Заявка будет согласован.
			   	|Продолжить?"; 
			
		ИначеЕсли ИмяКоманды = "НеСогласована" Тогда 
			
			ТекстВопроса = 
				"Заявка не будет согласована, работа с документом будет остановлена.
				|Продолжить?";		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяКоманды = "ПередатьВРаботу" Тогда
		
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		ЗаголовокВопроса = "Передать заявку в работу";
		
		ТекстВопроса = 
			"Заявка будет передана в работу.
			|Изменение заявки в процессе ее выполнения будет невозможно!
			|200 тысяч раз подумай, перед тем как согласиться!
			|Сходи к магу, к колдунье, спроси - что тебе делать в такой ситуации!
			|
			|Уверен? Продолжить?";

	КонецЕсли;
	
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения(МетодОповещения, МодульХраненияМетодаОповещения, ДополнительныеПараметрыОповещения),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		60,,
		ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомплектующих(Команда)
	
	ОткрытьФорму("Документ.смартЗаявкаНаРазборкуОборудования.Форма.ФормаПодбораКомплектующих",
					Новый Структура("Оборудование", ЭтаФорма.РемонтируемоеОборудование),
					ЭтаФорма,,,,,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомплектующую(Команда)
	
	ОткрытьФорму("Документ.смартЗаявкаНаРазборкуОборудования.Форма.ФормаСозданияКомплектующей",
					,
					ЭтаФорма,,,,,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПанельЗатраченногоВремени(Команда)

	Элементы.ГруппаЗатраченноеВремяИКнопка.Скрыть();
	Элементы.ГруппаЗатраченноеВремяИКнопка2.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояние(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьСостояниеЗавершение", ЭтаФорма);
	ОткрытьФорму("Перечисление.смартСостоянияЗаявокНаРазборкуОборудования.ФормаВыбора",, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОтменитьЗаявкуЗавершение", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Вы уверены, что хотите отменить заявку ?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура КомплектующиеНоменклатураПриИзменении(Элемент)
	
	КомплектующиеНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомплектующиеНоменклатураПриИзмененииНаСервере()

	Для Каждого СтрокаКомплектующие Из Объект.Комплектующие Цикл
		
		СтрокаКомплектующие.АртикулСтрокой = 
			?(ЗначениеЗаполнено(СтрокаКомплектующие.Номенклатура),
				СтрокаКомплектующие.Номенклатура.Артикул,
				СтрокаКомплектующие.АртикулСтрокой);
				
		СтрокаКомплектующие.НаименованиеСтрокой = 
			?(ЗначениеЗаполнено(СтрокаКомплектующие.Номенклатура),
				СтрокаКомплектующие.Номенклатура.Наименование,
				СтрокаКомплектующие.НаименованиеСтрокой);
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриИзменении(Элемент)
	
	ЭтаФорма.УзелДоляСтоимости = 100 - Объект.Комплектующие.Итог("ДоляСтоимости");
	СформироватьНаименованиеНовогоУзла();
	
КонецПроцедуры

&НаСервере
Процедура ИнженерПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Инженер)
		Или Не ЗначениеЗаполнено(Объект.Инженер.ФизическоеЛицо) 
		Тогда
		Возврат;
	КонецЕсли;
	
	СкладИнженера = 
		Справочники.Склады.НайтиПоРеквизиту(
			"ТекущийОтветственный", 
			Объект.Инженер.ФизическоеЛицо);
			
	Если СкладИнженера.Пустая() Тогда
		Возврат;
	КонецЕсли;
			
	Для Каждого СтрокаТаблицы Из Объект.Комплектующие Цикл
		СтрокаТаблицы.ПереместитьНаСклад = СкладИнженера;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнженерПриИзменении(Элемент)
	ИнженерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СформироватьНаименованиеНовогоУзла();
	
КонецПроцедуры

//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНоменклатуры = ПолучитьВладельцаСерий(Объект.Номенклатура);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", Новый Структура("ВидНоменклатуры", ВидНоменклатуры), Элемент);
	
КонецПроцедуры
//-- #Б2022 смарт: Шляпников 10.02.2025

&НаКлиенте
Процедура КомплектующиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Комплектующие.ТекущиеДанные.НеЗаказывать = Объект.СборкаНеТребуется;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СборкаНеТребуетсяПриИзменении(Элемент)
	
	Для Каждого стрКомплектующая Из Объект.Комплектующие Цикл
		стрКомплектующая.НеЗаказывать = Объект.СборкаНеТребуется;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеСтоимостьПриИзменении(Элемент)
	
	РассчитатьДолюСтоимостиВТекущейСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеКоличествоПриИзменении(Элемент)
	
	РассчитатьДолюСтоимостиВТекущейСтроке();
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)  
	
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()  
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
	Элементы.ГруппаСогласованиеКнопки.Видимость = Ложь;
	Элементы.КСогласованию.Видимость = Ложь;
	Элементы.КомплектующиеСоздатьКомплектующую.Видимость = Ложь;
	//-- #Б2022 смарт: Шляпников 10.02.2025

	ЭтаФорма.УзелДоляСтоимости = 100 - Объект.Комплектующие.Итог("ДоляСтоимости");
	
	ТекущееСостояние = РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ПолучитьСостояниеЗаявки(Объект.Ссылка);	
	//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
	Если ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.Выполнена
		И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.КомплектующиеПодборКомплектующих.Доступность = Ложь;
		Элементы.ПоискОборудованияПоСкладам.Доступность = Ложь;
		
		Возврат;
		
	КонецЕсли;
	//-- #Б2022 смарт: Шляпников 10.02.2025
	
	//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
	Если (ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.ВводНоменклатуры
		ИЛИ ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.НаСогласовании
		ИЛИ ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.НеСогласована
		ИЛИ ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.Выполнена
		ИЛИ ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.ВРаботе)
		И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		Элементы.СтраницаРазбираемоеОборудование.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.НаСогласовании Тогда
		Элементы.ПоискОборудованияПоСкладам.Доступность = Ложь;
	КонецЕсли;
	
	Если ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.ВРаботе
		И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		Элементы.СтраницаПолучаемыйУзелИЗапасныеЧасти.ТолькоПросмотр = Истина;
		Элементы.КомплектующиеПодборКомплектующих.Доступность = Ложь;
		Элементы.ПоискОборудованияПоСкладам.Доступность = Ложь;
		
	КонецЕсли;
	//-- #Б2022 смарт: Шляпников 10.02.2025
	
	//++ #6068 смарт: Тимофеева 01.04.2026 /  Заявка на разборку оборудования. Изменение доступа к корректировке реквизитов.
	ЭтоВводНоменклатуры = ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.ВводНоменклатуры;
	Элементы.СтраницаПолучаемыйУзелИЗапасныеЧасти.ТолькоПросмотр = НЕ ЭтоВводНоменклатуры И НЕ Пользователи.РолиДоступны("ПолныеПрава");
	Элементы.КомплектующиеПодборКомплектующих.Доступность = ЭтоВводНоменклатуры ИЛИ Пользователи.РолиДоступны("ПолныеПрава");
	//-- #6068 смарт: Тимофеева 01.04.2026
	
	МенеджерСтатусов = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования;
	
	//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
	Если Объект.Отменена И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.КомплектующиеПодборКомплектующих.Доступность = Ложь;
		Элементы.ПоискОборудованияПоСкладам.Доступность = Ложь;
		Элементы.ПричинаНесогласования.Видимость = 
			Объект.СтатусСогласования = МенеджерСтатусов.НеСогласована;
			
		Возврат;
			
	КонецЕсли;
	//-- #Б2022 смарт: Шляпников 10.02.2025
	
	Если Объект.СтатусСогласования = МенеджерСтатусов.КСогласованию Тогда
		//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
		ЭтаФорма.ТолькоПросмотр = Не Пользователи.РолиДоступны("смартСогласованиеЗаявокНаРазборкуОборудования,ПолныеПрава");
		//-- #Б2022 смарт: Шляпников 10.02.2025
	КонецЕсли;
				
	Если Объект.СтатусСогласования = МенеджерСтатусов.НеУстановлен
		Или Объект.СтатусСогласования = МенеджерСтатусов.КСогласованию Тогда
		
		Элементы.СтраницаПолучаемыйУзелИЗапасныеЧасти.Доступность = Ложь;
		Элементы.ГруппаСогласованиеКнопки.Видимость = Истина;
	
		Если Объект.СтатусСогласования = МенеджерСтатусов.НеУстановлен Тогда
			
			Элементы.КСогласованию.Видимость = Истина;
			
		ИначеЕсли Объект.СтатусСогласования = МенеджерСтатусов.КСогласованию Тогда
					
			ЕстьПравоНаСогласование = Пользователи.РолиДоступны("смартСогласованиеЗаявокНаРазборкуОборудования");
 
			Элементы.Согласовать.Видимость = ЕстьПравоНаСогласование;
			Элементы.НеСогласовано.Видимость = ЕстьПравоНаСогласование; 
			ЭтаФорма.ТолькоПросмотр = Не ЕстьПравоНаСогласование;
			
		КонецЕсли;
				
	Иначе
		
		//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
		Элементы.СтраницаПолучаемыйУзелИЗапасныеЧасти.Доступность = Истина;
		//-- #Б2022 смарт: Шляпников 10.02.2025
		Элементы.ПередатьВРаботу.Видимость = Не Объект.КВыполнению;
		
	КонецЕсли;
	
	Если Объект.СтатусСогласования = МенеджерСтатусов.Согласована Тогда
		
		//Элементы.Инженер.АвтоОтметкаНезаполненного = Истина;	
		//Элементы.НачалоРабот.АвтоОтметкаНезаполненного = Истина;	
		//Элементы.ОкончаниеРабот.АвтоОтметкаНезаполненного = Истина;	
		//Элементы.Узел.АвтоОтметкаНезаполненного = Истина;
		//Элементы.КомплектующиеДоляСтоимости.АвтоОтметкаНезаполненного = Истина;
		
		Элементы.ПоискОборудованияПоСкладам.Доступность = Пользователи.РолиДоступны("ПолныеПрава");
		
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
			Элементы.СтраницаРазбираемоеОборудование.ТолькоПросмотр = Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ИзменитьСостояние.Видимость = Пользователи.РолиДоступны("ПолныеПрава");
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ПоискОборудованияПоСкладам.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте                 
Процедура ОбработатьРезультатОтветаНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
		
	ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	
	РежимПроведенияДокументаОпределение = 
		?(ЗначениеЗаполнено(Объект.Ссылка), 
			РежимПроведенияДокумента.Неоперативный, 
			РежимПроведенияДокумента.Оперативный); 
	
	Если ИмяКоманды = "КСогласованию"
			Или ИмяКоманды = "Согласована"
			Или ИмяКоманды = "НеСогласована" Тогда 
			
		//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
		Если НЕ ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		//-- #Б2022 смарт: Шляпников 10.02.2025

		Если ИмяКоманды = "НеСогласована" Тогда
			
			ПоказатьВводСтроки(
				Новый ОписаниеОповещения("ОбработатьПолучениеПричиныНесогласования", ЭтаФорма, РежимПроведенияДокументаОпределение),
				"",
				"Уточните причину, по которой в согласовании заявки отказано.",
				1024,
				Истина);
				
		Иначе 
			
			//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
			ИзменитьСтатусСогласования(ДополнительныеПараметры.ИмяКоманды);
			ЗаписатьДокумент(РежимПроведенияДокументаОпределение);
			Закрыть();
			//-- #Б2022 смарт: Шляпников 10.02.2025
				
		КонецЕсли;
				
	ИначеЕсли ИмяКоманды = "ПередатьВРаботу" Тогда
		
		УстановитьПризнакКВыполнению(Истина);
		Если ПроверитьЗаполнение() Тогда
			
			Если Не СформироватьУзел() Тогда
				Возврат;	
			КонецЕсли;
			
	 		ЭтаФорма.Записать(
				Новый Структура("РежимЗаписи, РежимПроведения, ТребуетсяЗакрытьФорму", 
					РежимЗаписиДокумента.Проведение, РежимПроведенияДокументаОпределение));
					
		Иначе	
			УстановитьПризнакКВыполнению(Ложь);		
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
&НаСервере
Процедура УстановитьПричинуНесогласования(Причина, РежимПроведенияДокументаОпределение)
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.ПричинаНесогласования = Причина;
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаписатьДокумент(РежимПроведенияДокументаОпределение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокумент(РежимПроведенияДокументаОпределение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Записать(Новый Структура("РежимЗаписи, РежимПроведения, ТребуетсяЗакрытьФорму", 
							  РежимЗаписиДокумента.Проведение, РежимПроведенияДокументаОпределение));
							  
	УстановитьВидимость();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаСерий(Номенклатура)
	
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ВидНоменклатуры, ВидНоменклатуры.ВладелецСерий");
	Если ЗначениеЗаполнено(ДанныеНоменклатуры.ВидНоменклатурыВладелецСерий) Тогда
		Возврат ДанныеНоменклатуры.ВидНоменклатурыВладелецСерий;
	Иначе
		Возврат ДанныеНоменклатуры.ВидНоменклатуры;
	КонецЕсли;
	
КонецФункции
//-- #Б2022 смарт: Шляпников 10.02.2025

&НаКлиенте
Процедура ОбработатьПолучениеПричиныНесогласования(ВведеннаяСтрока, РежимПроведенияДокументаОпределение) Экспорт

	//++ #Б2022 смарт: Шляпников 10.02.2025 / Заявка на разборку оборудования. Исправление ошибок.
	Если НЕ ЗначениеЗаполнено(ВведеннаяСтрока) Тогда
		Сообщить("Указание причины несогласование обязательно !", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусСогласования("НеСогласована");
	УстановитьПричинуНесогласования(ВведеннаяСтрока, РежимПроведенияДокументаОпределение);
	
	Закрыть();
	//-- #Б2022 смарт: Шляпников 10.02.2025
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусСогласования(ВыбранныйСтатус)

	Объект.СтатусСогласования = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования[ВыбранныйСтатус];
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакКВыполнению(Значение)
	
	Объект.КВыполнению = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗатраченноеВремя()

	РассчитатьЗатраченноеВремяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЗатраченноеВремяНаСервере()
	
	Для Нум = 1 По 2 Цикл
		
		ЕстьНезаполненныеПоля = Ложь;
		Постфикс = ?(Нум = 2, "2", ""); 
		Таблица = Объект["ЗатраченноеВремяИнженера" + Постфикс];
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаИВремяНачалаРабот) 
				И ЗначениеЗаполнено(СтрокаТаблицы.ДатаИВремяОкончанияРабот) Тогда 
				
				СтрокаТаблицы.Часы = (СтрокаТаблицы.ДатаИВремяОкончанияРабот - СтрокаТаблицы.ДатаИВремяНачалаРабот) / 60 / 60;
				
			Иначе
				
				ЕстьНезаполненныеПоля = Истина;
				СтрокаТаблицы.Часы = 0;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Объект["ЗатраченоЧасов" + Постфикс] = ?(ЕстьНезаполненныеПоля, 0, Таблица.Итог("Часы"));	
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименованиеНовогоУзла()

	НайденныеСтроки = 
		ЭтаФорма.Объект.Комплектующие.НайтиСтроки(
			Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка()));
			
	Если НайденныеСтроки.Количество() Тогда
		Возврат;
	КонецЕсли;

	Таблица = ЭтаФорма.Объект.Комплектующие.Выгрузить(, "Номенклатура, Количество");
	ДополнитьМассивКомплектующихРекурсивно(ЭтаФорма.Объект.Номенклатура, Таблица);
	
	Таблица.Свернуть("Номенклатура", "Количество");
	
	Таблица.Колонки.Добавить("УникальныйИдентификаторСтрокой", 
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
		
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		СтрокаТаблицы.УникальныйИдентификаторСтрокой = 
			Строка(СтрокаТаблицы.Номенклатура.УникальныйИдентификатор());
		
	КонецЦикла;
	
	Таблица.Сортировать("УникальныйИдентификаторСтрокой Возр");
	
	ЭтаФорма.КорневоеОборудование = ПолучитьКорневойУзелРазобранногоОборудования(Объект.Номенклатура);
	
	РазобранноеОборудованиеИдентификаторУзла = "";
	
	//++ #Б2028 смарт: Шляпников 11.02.2025 / Заявка на разборку оборудования. Формирование нового узла номенклатуры (результат разборки).
	МассивИдентификаторов = Новый Массив;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		МассивИдентификаторов.Добавить(СтрШаблон("%1#%2", СтрокаТаблицы.УникальныйИдентификаторСтрокой, СтрокаТаблицы.Количество));
	КонецЦикла;
	
	РазобранноеОборудованиеИдентификаторУзла = СтрСоединить(МассивИдентификаторов, ";");
	
	CRC32 = Новый ХешированиеДанных(ХешФункция.CRC32);
	CRC32.Добавить(РазобранноеОборудованиеИдентификаторУзла);
	
	РазобранноеОборудованиеИдентификаторУзла = СтрЗаменить(Строка(CRC32.ХешСумма), Символы.НПП, "");
	
	НаименованиеУзла = СтрШаблон("%1 (Не комплект:%2)", ЭтаФорма.КорневоеОборудование.Наименование, РазобранноеОборудованиеИдентификаторУзла);
	КоличествоСимволовОбрезания = СтрДлина(НаименованиеУзла) - Метаданные.Справочники.Номенклатура.ДлинаНаименования;
	Если КоличествоСимволовОбрезания > 0 Тогда
		ОбрезанноеНаименованиеРазбираемогоОборудования = Лев(ЭтаФорма.КорневоеОборудование.Наименование, СтрДлина(ЭтаФорма.КорневоеОборудование.Наименование) - КоличествоСимволовОбрезания);
		НаименованиеУзла = СтрШаблон("%1 (Не комплект:%2)", ОбрезанноеНаименованиеРазбираемогоОборудования, РазобранноеОборудованиеИдентификаторУзла);
	КонецЕсли;
	//-- #Б2028 смарт: Шляпников 11.02.2025
	
	ЭтаФорма.Объект.Узел = НайтиСуществующийУзел(РазобранноеОборудованиеИдентификаторУзла);
			
	ЭтаФорма.Элементы.Узел.ПодсказкаВвода = НаименованиеУзла;
	ЭтаФорма.ИдентификаторНовогоУзла = РазобранноеОборудованиеИдентификаторУзла; 
	
КонецПроцедуры

&НаСервере
Функция НайтиСуществующийУзел(РазобранноеОборудованиеИдентификаторУзла)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.смартРазобранноеОборудование = &смартРазобранноеОборудование
	|	И Номенклатура.смартРазобранноеОборудованиеИдентификаторУзла = &смартРазобранноеОборудованиеИдентификаторУзла";
	
	Запрос.УстановитьПараметр("смартРазобранноеОборудование", Объект.Номенклатура);
	Запрос.УстановитьПараметр("смартРазобранноеОборудованиеИдентификаторУзла", РазобранноеОборудованиеИдентификаторУзла);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

&НаСервере
Процедура ДополнитьМассивКомплектующихРекурсивно(РазобранноеОборудование, Таблица)

	Если Не ЗначениеЗаполнено(РазобранноеОборудование.смартРазобранноеОборудование) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РазобранноеОборудование.смартСнятыеКомплектующие, Таблица);
	ДополнитьМассивКомплектующихРекурсивно(РазобранноеОборудование.смартРазобранноеОборудование, Таблица);
 	
КонецПроцедуры

&НаСервере
Функция ПолучитьКорневойУзелРазобранногоОборудования(Оборудование) 

	Возврат ?(ЗначениеЗаполнено(Оборудование.смартРазобранноеОборудование),
				ПолучитьКорневойУзелРазобранногоОборудования(Оборудование.смартРазобранноеОборудование),
				Оборудование);
	
КонецФункции

&НаСервере
Функция СформироватьУзел()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Узел) Тогда
		Возврат Истина;
	КонецЕсли;
	
	НоваяНоменклатура = ЭтаФорма.Объект.Номенклатура.Скопировать();

	НоваяНоменклатура.Наименование = ЭтаФорма.Элементы.Узел.ПодсказкаВвода;
	НоваяНоменклатура.НаименованиеПолное = НоваяНоменклатура.Наименование; 
	
	//++ #Б2028 смарт: Шляпников 11.02.2025 / Заявка на разборку оборудования. Формирование нового узла номенклатуры (результат разборки).
	НоваяНоменклатура.Артикул = СтрШаблон("%1_%2", КорневоеОборудование.Артикул, ИдентификаторНовогоУзла);
	//-- #Б2028 смарт: Шляпников 11.02.2025
			
	НоваяНоменклатура.смартРазобранноеОборудование = ЭтаФорма.Объект.Номенклатура;
	
	Таблица = ЭтаФорма.Объект.Комплектующие.Выгрузить(, "Номенклатура, Количество");
	ДополнитьМассивКомплектующихРекурсивно(ЭтаФорма.Объект.Номенклатура, Таблица);

	Таблица.Колонки.Добавить("УникальныйИдентификаторСтрокой", 
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
		
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		СтрокаТаблицы.УникальныйИдентификаторСтрокой = 
			Строка(СтрокаТаблицы.Номенклатура.УникальныйИдентификатор());
		
	КонецЦикла;
	
	Таблица.Сортировать("УникальныйИдентификаторСтрокой Возр");
	Таблица.Свернуть("Номенклатура", "Количество");	
	
	НоваяНоменклатура.смартСнятыеКомплектующие.Загрузить(Таблица);
	
	НоваяНоменклатура.смартРазобранноеОборудованиеИдентификаторУзла = 
		ЭтаФорма.ИдентификаторНовогоУзла;
		
	НачатьТранзакцию();
	
	Попытка
		
		НоваяНоменклатура.Записать();
		ЭтаФорма.Объект.Узел = НоваяНоменклатура.Ссылка;
		
		ВыборкаУпаковок = Справочники.УпаковкиЕдиницыИзмерения.Выбрать(, ЭтаФорма.Объект.Номенклатура);
		Пока ВыборкаУпаковок.Следующий() Цикл
			
			НоваяУпаковка = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НоваяУпаковка, ВыборкаУпаковок,, "Код, Владелец");
			
			НоваяУпаковка.Владелец = НоваяНоменклатура.Ссылка;	
			
			НоваяУпаковка.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Истина;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон("Не удалось сформировать узел, по причине: %1%2", Символы.ПС, ТекстОшибки);
		Сообщить(ТекстСообщения);
		
		ОтменитьТранзакцию(); 
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура РассчитатьДолюСтоимостиВТекущейСтроке()
	
	Если Элементы.Комплектующие.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Комплектующие.НайтиПоИдентификатору(Элементы.Комплектующие.ТекущаяСтрока);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоличествоОстаток КАК Количество,
	|	СтоимостьОстаток + ДопРасходыОстаток КАК Стоимость
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			,
	|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
	|				И АналитикаУчетаНоменклатуры.Серия = &Серия
	|				И АналитикаУчетаНоменклатуры.МестоХранения = &Склад)";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("Серия", Объект.Серия);
	Запрос.УстановитьПараметр("Склад", ?(ЗначениеЗаполнено(Объект.ПереместитьСоСклада), Объект.ПереместитьСоСклада, Объект.Склад));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество <> 0 И Выборка.Стоимость <> 0 Тогда
		ТекущаяСтрока.ДоляСтоимости = ТекущаяСтрока.Стоимость * ТекущаяСтрока.Количество * 100 / Выборка.Стоимость / Выборка.Количество;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось рассчитать долю стоимости. Необходимо рассчитать себестоимость разбираемого оборудования.");
		ТекущаяСтрока.ДоляСтоимости = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОборудованияПоСкладамЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, Значение, "Номенклатура, Серия, Назначение");
		
	Если Не Значение.Склад = Объект.Склад Тогда
		Объект.ПереместитьСоСклада = Значение.Склад;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Если Значение = ПредопределенноеЗначение("Перечисление.смартСостоянияЗаявокНаРазборкуОборудования.Отменена") Тогда
			ОтменитьЗаявкуЗавершение(КодВозвратаДиалога.Да, Неопределено);
		Иначе
			ИзменитьСостояниеЗаявкиСервер(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСостояниеЗаявкиСервер(НовоеСостояние)
	
	Если НовоеСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.Отменена Тогда
		
		Объект.Отменена = Истина;
		Объект.КВыполнению = Ложь;
		Объект.КВыполнению = Ложь;
		Объект.СтатусСогласования = Неопределено;
		
	Иначе
		Объект.Отменена = Ложь;
	КонецЕсли;
	
	Записать();
	
	МенеджерЗаписи = РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Заявка = Объект.Ссылка;
	МенеджерЗаписи.Состояние = НовоеСостояние;
	МенеджерЗаписи.Записать(Истина);
	
	ТекущееСостояние = НовоеСостояние;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявкуЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьОтменыЗаявки() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ИзменитьСостояниеЗаявкиСервер(ПредопределенноеЗначение("Перечисление.смартСостоянияЗаявокНаРазборкуОборудования.Отменена"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьОтменыЗаявки()
	
	ТекущееСостояние = РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ПолучитьСостояниеЗаявки(Объект.Ссылка);
	Если НЕ ТекущееСостояние = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.Подготовка Тогда
		ОбщегоНазначения.СообщитьПользователю("Отменять можно только заявки в статусе ""Подготовка""", Объект.Ссылка);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Объект.Проведен Тогда
		ОбщегоНазначения.СообщитьПользователю("Отменять можно только проведенные заявки", Объект.Ссылка);
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	смартОборудованиеКРазборкеОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Обороты(, , Регистратор, Заявка = &Заявка) КАК смартОборудованиеКРазборкеОбороты
	|ГДЕ
	|	НЕ смартОборудованиеКРазборкеОбороты.Регистратор ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования";
	
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("По заявке уже созданы документы. Отмена невозможна.", Объект.Ссылка);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
